CodeHubot/CodeHubot-Fireware/firmware/aiot-esp32/sdkconfig.defaults
# ESP32-S3 DevKit Configuration
# This file contains default configuration for ESP32-S3 based AIOT project

# Target Configuration
CONFIG_IDF_TARGET="esp32s3"

# Serial flasher config
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Component config

# ESP32S3-Specific Configuration
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y

# PSRAM配置 - 明确禁用以避免内存测试失败
CONFIG_SPIRAM=n
CONFIG_ESP32S3_SPIRAM_SUPPORT=n

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Log output
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

# WiFi Configuration
CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP32_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP32_WIFI_STATIC_TX_BUFFER_NUM=0
CONFIG_ESP32_WIFI_DYNAMIC_TX_BUFFER_NUM=32

# LWIP
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65535
CONFIG_LWIP_TCP_WND_DEFAULT=65535
CONFIG_LWIP_TCP_RECVMBOX_SIZE=32
CONFIG_LWIP_UDP_RECVMBOX_SIZE=32
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=32

# MQTT
CONFIG_MQTT_PROTOCOL_311=y
CONFIG_MQTT_TRANSPORT_SSL=y
CONFIG_MQTT_TRANSPORT_WEBSOCKET=y

# GPIO Configuration
CONFIG_GPIO_ESP32_SUPPORT_SWITCH_SLP_PULL=y

# PWM/LEDC Configuration
CONFIG_SOC_LEDC_SUPPORT_FADE_STOP=y

# HTTP Server Configuration - 解决配网页面 "Header fields are too long" 问题
# 某些手机应用（华为、小红书等）会发送超大的HTTP请求头
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_HTTPD_MAX_URI_LEN=1024

# Application Configuration - Board Selection
# 板子选择：取消注释其中一个，注释掉其他的
# CONFIG_AIOT_BOARD_ESP32_S3_DEVKIT=y
# CONFIG_AIOT_BOARD_ESP32_S3_DEVKIT_RAIN=y
CONFIG_AIOT_BOARD_ESP32_S3_DEVKIT_LITE=y

# 板子配置会自动设置以下值：
# - CONFIG_AIOT_BOARD_NAME
# - CONFIG_AIOT_PRODUCT_CODE

# Legacy Configuration (保留兼容性)
CONFIG_AIOT_LED_COUNT=2
CONFIG_AIOT_RELAY_COUNT=2
CONFIG_AIOT_SERVO_COUNT=2
CONFIG_AIOT_SENSOR_COUNT=2

# Main Task Stack Size (增加栈大小以支持更多调试日志和局部变量)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=12288

# System Event Task Stack Size (增加栈大小以避免在事件处理器中栈溢出)
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096